Tester/src/Catalogs/ErrorLog/ErrorLog.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ErrorLog</name>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FullText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </attributes>
  <attributes>
    <name>Line</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Row</name>
    <type>
      <types>DefinedType.LineNumber</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Versions</types>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Screenshot</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ScreenshotExists</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Session</name>
    <type>
      <types>CatalogRef.Sessions</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Stack</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Versions</types>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Catalogs/ErrorLog/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )

	readApplication ();
	setScreenshot ();
	ErrorLogForm.UpdateStack ( Object.Ref, Stack );
	AppearanceSrv.Read ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readApplication ()
	
	ScenarioApplication = DF.Pick ( Object.Scenario, "Application" );
	
EndProcedure

&AtServer
Procedure setScreenshot ()
	
	if ( Object.ScreenshotExists ) then
		Screenshot = GetURL ( Object.Ref, "Screenshot" );
	else
		Screenshot = "";
	endif; 

EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure ShowInList ( Command )
	
	openList ();
	Close ();
	
EndProcedure

&AtClient
Procedure openList ()
	
	ref = Object.Ref;
	form = GetForm ( "Catalog.ErrorLog.ListForm", new Structure ( "CurrentRow", ref ) );
	table = form.Items.List;
	table.CurrentRow = ref;
	form.Open ();
	if ( table.CurrentRow = undefined ) then
		Output.ErrorNotLocated ();
	endif;
	
EndProcedure

// *****************************************
// *********** Table Stack

&AtClient
Procedure StackSelection ( Item, SelectedRow, Field, StandardProcessing )
	
	StandardProcessing = false;
	ErrorLogForm.OpenScenario ( Item );
	Close ();
	
EndProcedure

// *****************************************
// *********** Screenshot Field

&AtClient
Procedure ScreenshotClick ( Item, StandardProcessing )
	
	StandardProcessing = false;
	showPicture ();
	
EndProcedure

&AtClient
Procedure showPicture ()
	
	if ( Screenshot = "" ) then
		return;
	endif; 
	p = new Structure ();
	p.Insert ( "Title", Object.Ref );
	p.Insert ( "URL", Screenshot );
	OpenForm ( "CommonForm.Screenshot", p );
	
EndProcedure
